clear all;
close all;
%% [e(k) Δx(k)]  15*15  这是例2中预见长度为 0 的程序
I_N = eye(5);
I_m = eye(1);
I_mN = eye(5);
I_s3 = eye(15);%%%%%%%  求解LMI的单位矩阵

% A1 = [ 0.5712  0.0006;
%        0.0017  0.3679];
% A2 = [  0.2780  0.0004;
%         0.0006  0.3679];
% B = [ 0.7657;
%       0.0011];
t=0.35;
A1 = t* [ 1     1
            -1.55  0.65 ];
A2 = t* [ 1     1
            -2  1.1 ];
B = t*[ 0;
          1 ];  

A1_d = t* [   0.07  0.02;
             0.09  0.051 ];  
A2_d = t* [    0.05  0.078;
             0.05  0.017 ];  
    
C = [ 0.01  1 ];


L = [ 2  -1  -1  0  0;
      -1  2  -1  0  0;
     -1 0  3   -1  -1;
      -1 -1  -1   4   -1;
     -1  0 -1  -1   3];
M = [ 1 0 0 0 0;
      0 1 0 0 0;
      0 0 1 0 0;
      0 0 0 1 0;
      0 0 0 0 1 ];
H = L + M;

A_R0_1 = [    I_N  kron(-H,C*A1);
            zeros(10,5)  kron(I_N,A1) ];
A_R0_1_d = [ zeros(5)  kron(-H,C*A1_d);
             zeros(10,5)  kron(I_N,A1_d) ];

A_R0_2 = [    I_N  kron(-H,C*A2);
            zeros(10,5)  kron(I_N,A2) ];
A_R0_2_d = [ zeros(5)  kron(-H,C*A2_d);
             zeros(10,5)  kron(I_N,A2_d) ];

B_R0 = [    kron(-H,C*B);
            kron(I_N,B) ];
G_hat = eye(15) - B_R0*inv(B_R0'*B_R0)*B_R0';

F = [ kron(-H,C);
      eye(10)];
D = [ eye(5)  zeros(5,10) ];

G1 = [zeros(10,5) eye(10)];

%%
setlmis([]);

%%
% 
gama = lmivar(2,[1,1]);
% 表示矩阵
P0 = lmivar(1,[15,1]); % P
Q0 = lmivar(1,[15,1]); % Q
R0 = lmivar(1,[15,1]);  % R
Y01 = lmivar(2,[5,15]); % Y1
Y02 = lmivar(2,[5,15]); % Y2


%% 第一个大矩阵 < 0
% (1,1)
lmiterm([1 1 1 Q0],1,1);
% lmiterm([1 1 1 R0'],-(A_R0_1-eye(35)),1);
lmiterm([1 1 1 Y01],-B_R0,1,'s');
lmiterm([1 1 1 R0],-1,(A_R0_1-I_s3)','s');
% lmiterm([1 1 1 Y01'],-1,B_R0');

% (1,2)
lmiterm([1 1 2 P0],1,1);
lmiterm([1 1 2 R0'],1,1);
lmiterm([1 1 2 -R0],1,(A_R0_1-I_s3)');
lmiterm([1 1 2 -Y01'],1,B_R0');

% (1,3)
lmiterm([1 1 3 R0'],-G_hat*A_R0_1_d,1);

% (1,4)
lmiterm([1 1 4 0],-G_hat*F);

% (1,5)
lmiterm([1 1 5 R0],1,D');

% (2,2)
lmiterm([1 2 2 P0],1,1);
lmiterm([1 2 2 R0],1,1,'s');
% lmiterm([1 2 2 R0'],1,1);

% (2,3)
lmiterm([1 2 3 R0'],-G_hat*A_R0_1_d,1);

% (2,4)
lmiterm([1 2 4 0],-G_hat*F);

% (2,5)
lmiterm([1 2 5 0],0);

% (3,3)
lmiterm([1 3 3 Q0],-1,1);

% (3,4)
lmiterm([1 3 4 0],0);

% (3,5)
lmiterm([1 3 5 0],0);

% (4,4)
lmiterm([1 4 4 gama^2],-1,eye(10));

% (4,5)
lmiterm([1 4 5 0],0);

% (5,5)
lmiterm([1 5 5 0],-eye(5));

%% 第二个大矩阵 < 0
% (1,1)
lmiterm([2 1 1 Q0],1,1);
% lmiterm([1 1 1 R0'],-(A_R0_1-eye(35)),1);
lmiterm([2 1 1 Y02],-B_R0,1,'s');
lmiterm([2 1 1 R0],-1,(A_R0_2-I_s3)','s');
% lmiterm([1 1 1 Y01'],-1,B_R0');

% (1,2)
lmiterm([2 1 2 P0],1,1);
lmiterm([2 1 2 R0'],1,1);
lmiterm([2 1 2 -R0],1,(A_R0_2-I_s3)');
lmiterm([2 1 2 -Y02'],1,B_R0');

% (1,3)
lmiterm([2 1 3 R0'],-G_hat*A_R0_2_d,1);

% (1,4)
lmiterm([2 1 4 0],-G_hat*F);

% (1,5)
lmiterm([2 1 5 R0],1,D');

% (2,2)
lmiterm([2 2 2 P0],1,1);
lmiterm([2 2 2 R0],1,1,'s');
% lmiterm([1 2 2 R0'],1,1);

% (2,3)
lmiterm([2 2 3 R0'],-G_hat*A_R0_2_d,1);

% (2,4)
lmiterm([2 2 4 0],-G_hat*F);

% (2,5)
lmiterm([2 2 5 0],0);

% (3,3)
lmiterm([2 3 3 Q0],-1,1);

% (3,4)
lmiterm([2 3 4 0],0);

% (3,5)
lmiterm([2 3 5 0],0);

% (4,4)
lmiterm([2 4 4 gama^2],-1,eye(10));

% (4,5)
lmiterm([2 4 5 0],0);

% (5,5)
lmiterm([2 5 5 0],-eye(5));

%% 第三个大矩阵 < 0
% (1,1)
lmiterm([3 1 1 Q0],2,1);
lmiterm([3 1 1 R0'],-(3/2)*(A_R0_1-I_s3),1,'s');
lmiterm([3 1 1 Y02],-(1/2)*B_R0,1,'s');
lmiterm([3 1 1 R0'],-(1/2)*(A_R0_2-I_s3),1,'s');
lmiterm([3 1 1 Y01],-(3/2)*B_R0,1,'s');

% (1,2)
lmiterm([3 1 2 P0],2,1);
lmiterm([3 1 2 R0'],2,1);
lmiterm([3 1 2 -R0],3/2,(A_R0_1-I_s3)');
lmiterm([3 1 2 -Y02'],1/2,B_R0');
lmiterm([3 1 2 -R0],1/2,(A_R0_2-I_s3)');
lmiterm([3 1 2 -Y01'],3/2,B_R0');

% (1,3)
lmiterm([3 1 3 R0'],-(3/2)*G_hat*A_R0_1_d,1);
lmiterm([3 1 3 R0'],-(1/2)*G_hat*A_R0_2_d,1);

% (1,4)
lmiterm([3 1 4 0],-2*G_hat*F);

% (1,5)
lmiterm([3 1 5 R0],2,D');

% (2,2)
lmiterm([3 2 2 P0],2,1);
lmiterm([3 2 2 R0],2,1,'s');

% (2,3)
lmiterm([3 2 3 R0'],-(3/2)*G_hat*A_R0_1_d,1);
lmiterm([3 2 3 R0'],-(1/2)*G_hat*A_R0_2_d,1);

% (2,4)
lmiterm([3 2 4 0],-2*G_hat*F);

% (2,5)
lmiterm([3 2 5 0],0);

% (3,3)
lmiterm([3 3 3 Q0],-2,1);

% (3,4)
lmiterm([3 3 4 0],0);

% (3,5)
lmiterm([3 3 5 0],0);

% (4,4)
lmiterm([3 4 4 gama^2],-2,eye(10));

% (4,5)
lmiterm([3 4 5 0],0);

% (5,5)
lmiterm([3 5 5 0],-2*eye(5));

%% 第四个大矩阵 < 0
% (1,1)
lmiterm([4 1 1 Q0],2,1);
lmiterm([4 1 1 R0'],-(1/2)*(A_R0_1-I_s3),1,'s');
lmiterm([4 1 1 Y02],-(3/2)*B_R0,1,'s');
lmiterm([4 1 1 R0'],-(3/2)*(A_R0_2-I_s3),1,'s');
lmiterm([4 1 1 Y01],-(1/2)*B_R0,1,'s');

% (1,2)
lmiterm([4 1 2 P0],2,1);
lmiterm([4 1 2 R0'],2,1);
lmiterm([4 1 2 -R0],1/2,(A_R0_1-I_s3)');
lmiterm([4 1 2 -Y02'],3/2,B_R0');
lmiterm([4 1 2 -R0],3/2,(A_R0_2-I_s3)');
lmiterm([4 1 2 -Y01'],1/2,B_R0');

% (1,3)
lmiterm([4 1 3 R0'],-(1/2)*G_hat*A_R0_1_d,1);
lmiterm([4 1 3 R0'],-(3/2)*G_hat*A_R0_2_d,1);

% (1,4)
lmiterm([4 1 4 0],-2*G_hat*F);

% (1,5)
lmiterm([4 1 5 R0],2,D');

% (2,2)
lmiterm([4 2 2 P0],2,1);
lmiterm([4 2 2 R0],2,1,'s');

% (2,3)
lmiterm([4 2 3 R0'],-(1/2)*G_hat*A_R0_1_d,1);
lmiterm([4 2 3 R0'],-(3/2)*G_hat*A_R0_2_d,1);

% (2,4)
lmiterm([4 2 4 0],-2*G_hat*F);

% (2,5)
lmiterm([4 2 5 0],0);

% (3,3)
lmiterm([4 3 3 Q0],-2,1);

% (3,4)
lmiterm([4 3 4 0],0);

% (3,5)
lmiterm([4 3 5 0],0);

% (4,4)
lmiterm([4 4 4 gama^2],-2,eye(10));

% (4,5)
lmiterm([4 4 5 0],0);

% (5,5)
lmiterm([4 5 5 0],-2*eye(5));


%% 约束条件
lmiterm([-5 1 1 P0],1,1);
lmiterm([5 1 1 0],0);

lmiterm([-6 1 1 gama],1,1);
lmiterm([6 1 1 0],0);

lmiterm([-7 1 1 Q0],1,1);
lmiterm([7 1 1 0],0);

%%
lmisys=getlmis;
options=[0,0,0,0,0];
[tmin,xfeas]=feasp(lmisys,options); 

%%
gama = dec2mat(lmisys,xfeas,gama);
P0 = dec2mat(lmisys,xfeas,P0);
Q0 = dec2mat(lmisys,xfeas,Q0);
R0 = dec2mat(lmisys,xfeas,R0);
Y01 = dec2mat(lmisys,xfeas,Y01);
Y02 = dec2mat(lmisys,xfeas,Y02);

K1_15 = Y01 * inv(R0')
K2_15 = Y02 * inv(R0')

%K1_15 = [1.35380090268457,0.424369756085084,0.0600504331942795,-0.00851109266189023,-0.0123452443148623,-0.709239321930024,-0.000820643221062142,0.0146128704655031,-2.76404022874821e-05,0.0129052792520411,-2.35189281610845e-05,0.0134437434989495,-2.28054289757066e-05,0.0125512112658083,-2.30415619416126e-05;0.592960570713160,1.04889526689180,0.201436966475661,0.0221240405032056,0.0333505982024886,0.0146128704654960,-2.76404022874823e-05,-0.717938862387452,-0.000810530524571688,0.0136460419541865,-2.07721643283486e-05,0.0124148294475810,-1.97180747861698e-05,0.0118461994641651,-2.00125812473361e-05;0.625236564176540,0.470446468111835,0.616498943371209,0.106909856675383,0.159879113331582,0.0129052792520380,-2.35189281610828e-05,0.0136460419541908,-2.07721643283475e-05,-0.727159691530299,-0.000802383069834330,0.0120815475112400,-1.69884234742906e-05,0.0123206140576941,-1.74364578474862e-05;0.632268209886559,0.477148440550941,0.214198776047092,0.513158593096916,0.162636506581904,0.0134437434989515,-2.28054289757068e-05,0.0124148294475889,-1.97180747861701e-05,0.0120815475112461,-1.69884234742933e-05,-0.727931779630812,-0.000800919796466229,0.0107494066749783,-1.64500594135995e-05;0.628489237685512,0.474057354169865,0.212334407740433,0.0271046129848048,0.644402418267789,0.0125512112658045,-2.30415619416121e-05,0.0118461994641703,-2.00125812473368e-05,0.0123206140576958,-1.74364578474879e-05,0.0107494066749746,-1.64500594135986e-05,-0.724539530659304,-0.000802413226315286];


%K2_15 = [1.35380117773157,0.424369934557641,0.0600505039981754,-0.00851105954061347,-0.0123451955043359,-0.326321600805783,-0.000482707953075222,0.0146129219255758,1.79721511881124e-05,0.0129053246922273,1.57142151789274e-05,0.0134437908297506,1.60773032046695e-05,0.0125512554600942,1.53124258199208e-05;0.592960784532791,1.04889544160820,0.201437035210227,0.0221240713254332,0.0333506439335613,0.0146129219255782,1.79721511881121e-05,-0.335021171860411,-0.000492293011993168,0.0136460899853730,1.59045122692884e-05,0.0124148731463247,1.46094707199115e-05,0.0118462411589477,1.41409050045805e-05;0.625236748359704,0.470446605946214,0.616499007826206,0.106909885486584,0.159879156982234,0.0129053246922338,1.57142151789209e-05,0.0136460899853766,1.59045122692821e-05,-0.344242033461593,-0.000502046012052843,0.0120815900437056,1.38523313315382e-05,0.0123206574265283,1.41394051233952e-05;0.632268387827575,0.477148571650219,0.214198832827185,0.513158625714953,0.162636547163994,0.0134437908297494,1.60773032046639e-05,0.0124148731463211,1.46094707199056e-05,0.0120815900436991,1.38523313315385e-05,-0.345014124274219,-0.000502988549792964,0.0107494445116089,1.25438924527379e-05;0.628489418920460,0.474057488108710,0.212334466488664,0.0271046393204998,0.644402470397914,0.0125512554600913,1.53124258199165e-05,0.0118462411589434,1.41409050045770e-05,0.0123206574265214,1.41394051233980e-05,0.0107494445116079,1.25438924527391e-05,-0.341621863360913,-0.000499654558895119];

%% [e(k) Δx(k) ] 15*15
A_R0_1_2 = [    I_N  kron(-H,C*A1);
            zeros(10,5)  kron(I_N,A1) ];
A_R0_1_d_2 = [ zeros(5)  kron(-H,C*A1_d);
             zeros(10,5)  kron(I_N,A1_d) ];

A_R0_2_2 = [    I_N  kron(-H,C*A2)  ;
            zeros(10,5)  kron(I_N,A2) ];
A_R0_2_d_2 = [ zeros(5)  kron(-H,C*A2_d);
             zeros(10,5)  kron(I_N,A2_d) ];

B_R0_2 = [    kron(-H,C*B);
            kron(I_N,B) ];
        
G_hat_2 = eye(15) - B_R0*inv(B_R0'*B_R0)*B_R0';

F_2 = [ kron(-H,C);
      eye(10) ];
D_2 = [ eye(5)  zeros(5,10) ];


Z = zeros(10,1);
  
W= [ kron(-H,C)*Z;
     Z ]; % [e x1 x2 x3 r r1 d d1]
 
%%  R(k)
for k=1:1:1000
    if k<15
        R(:,k) =zeros(5,1);
    elseif k>=15 & k<=30
        R(:,k) = ( (k-15)/10 )*100*ones(5,1);
    else
        R(:,k) = 1.5*100*ones(5,1);
    end
end

%% 滑模面、控制律、输出
for k=1:1:121
    time(k)=(k-1)/20;
%%
      %预见长度(1,1)
      Z1(:,k)=[Z(1,k) Z(3,k) Z(5,k) Z(7,k) Z(9,k)];
      Z2(:,k)=[Z(2,k) Z(4,k) Z(6,k) Z(8,k) Z(10,k)];
      
      Tr0(:,k)=kron(I_N,C)*Z(:,k);
      
      if k>1
          % 误差 e
          W1(:,k)= -kron(H,I_m) * (kron(I_N,C)*Z(:,k) - R(:,k));
          % Δx 
          W2(:,k)=Z1(:,k)-Z1(:,k-1);
          W3(:,k)=Z2(:,k)-Z2(:,k-1);
      else
          W1(:,k)= -kron(H,I_m) * (kron(I_N,C)*Z(:,k) - R(:,k));
          
          W2(:,k)=Z1(:,k);
          W3(:,k)=Z2(:,k);
      end
      
      h1(:,k) =  ( 20*(   sin( (Z(2,k)+Z(4,k)+Z(6,k)+Z(8,k)+Z(10,k))/5  )   )^2  ) / (exp(2)+exp(5));
      %h1(:,k) = ( Z(1,k)*Z(1,k) +Z(3,k)*Z(3,k) +Z(5,k)*Z(5,k) +Z(7,k)*Z(7,k) +Z(9,k)*Z(9,k) )/2;
      h2(:,k) = 1-h1(:,k);
      
      if k>1
         
          S2(:,k) = B_R0_2'*[W1(:,k);W2(:,k);W3(:,k)] - B_R0_2'* ...
                  (   h1(:,k-1)*h1(:,k-1)*(A_R0_1_2 + B_R0_2*K1_15)* [W1(:,k-1);W2(:,k-1);W3(:,k-1)] + ...
                      h1(:,k-1)*h2(:,k-1)*( A_R0_1_2 + B_R0_2*K2_15 )*[W1(:,k-1);W2(:,k-1);W3(:,k-1)] + ...
                      h2(:,k-1)*h1(:,k-1)*( A_R0_2_2 + B_R0_2*K1_15 )*[W1(:,k-1);W2(:,k-1);W3(:,k-1)] + ...
                      h2(:,k-1)*h2(:,k-1)*( A_R0_2_2 + B_R0_2*K2_15 )*[W1(:,k-1);W2(:,k-1);W3(:,k-1)]...
                  );
      else
          S2(:,k) = B_R0_2'*[W1(:,k);W2(:,k);W3(:,k)];
      end
      
      e1=0;
      e2=0;
      
      % Δu(k) 的线性项
      for j=1:1:k
          e1=e1+W1(:,j);
      end

      % Δu(k) 的非线性项
      for j=1:1:k
          for jj=1:1:5
              sat(jj,j)=sign( S2(jj,j) );
          end
       
          if j>1
             if j>4
                WW(:,j) = ( h1(:,j)-h1(:,j-1)+h2(:,j)-h2(:,j-1) ) * (  kron(I_N,A1)*[Z1(:,j-1);Z2(:,j-1)] + kron(I_N,A1_d)*[Z1(:,j-3-1);Z2(:,j-3-1)] ) + ...
                          t*[ 0;  -0.01*cos(Z(1,j));  0;  -0.01*cos(Z(3,j));  0;  -0.01*cos(Z(5,j));  0;  -0.01*cos(Z(7,j)); 0;  -0.01*cos(Z(9,j)) ]; 
                
                %e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.45-1)*S2(:,j) + 0.57*sat + norm(inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2) * norm( WW(:,j)) ) + 0.008*norm( [W2(:,j) zeros(5,1)] );
                
                gbgf=inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2;
                e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.345-1)*S2(:,j) + 0.027*sat(:,j) + ...
                   [ norm(gbgf(:,1:5)) ,norm(gbgf(:,6:10)) ]* [ norm( WW(1:5,j)); norm( WW(5:10,j)) ] )...
                   +  0.008*norm( [W2(:,j) zeros(5,1)] ) ;
             else
                 WW(:,j) = ( h1(:,j)-h1(:,j-1)+h2(:,j)-h2(:,j-1) ) * (  kron(I_N,A1)*[Z1(:,j-1);Z2(:,j-1)] ) + ...
                     t*[ 0;  -0.01*cos(Z(1,j));  0;  -0.01*cos(Z(3,j));  0;  -0.01*cos(Z(5,j));  0;  -0.01*cos(Z(7,j)); 0;  -0.01*cos(Z(9,j)) ];
                
                %e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.45-1)*S2(:,j) + 0.57*sat + norm(inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2) * norm( WW(:,j)) )+ 0.008*norm( [W2(:,j) zeros(5,1)] );
                
                gbgf=inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2;
                e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.345-1)*S2(:,j) + 0.027*sat(:,j) + ...
                   [ norm(gbgf(:,1:5)) ,norm(gbgf(:,6:10)) ]* [ norm( WW(1:5,j)); norm( WW(5:10,j)) ] )...
                   +  0.008*norm( [W2(:,j) zeros(5,1)] ) ;
             end
             
          else
               WW(:,j) = t*[ 0;  -0.01*cos(Z(1,j));  0;  -0.01*cos(Z(3,j));  0;  -0.01*cos(Z(5,j));  0;  -0.01*cos(Z(7,j)); 0;  -0.01*cos(Z(9,j)) ];
               
              %e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.45-1)*S2(:,j) + 0.57*sat + norm(inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2) * norm( WW(:,j)) )+ 0.008*norm( [W2(:,j) zeros(5,1)] );
              
              gbgf=inv(B_R0_2'*B_R0_2)*B_R0_2'*F_2;
                e2=e2 + inv(B_R0_2'*B_R0_2)* (  (0.345-1)*S2(:,j) + 0.027*sat(:,j) + ...
                   [ norm(gbgf(:,1:5)) ,norm(gbgf(:,6:10)) ]* [ norm( WW(1:5,j)); norm( WW(5:10,j)) ] )...
                   +  0.008*norm( [W2(:,j) zeros(5,1)] ) ;
          end
      end
      
      if k>3
         U2(:,k)=( h1(:,k)*K1_15+h2(:,k)*K2_15 ) * [e1;Z1(:,k);Z2(:,k)] - ...
                 ( h1(:,k)*inv(B_R0_2'*B_R0_2)*B_R0_2'*A_R0_1_d +  h2(:,k)*inv(B_R0_2'*B_R0_2)*B_R0_2'*A_R0_2_d ) *...
                 [ e1;Z1(:,k-3);Z2(:,k-3) ] -e2 ;
             
         Z(:,k+1) =  h1(:,k) * (  kron(I_N,A1)*Z(:,k) + kron(I_N,A1_d)*Z(:,k-3) + kron(I_N,B)* ( U2(:,k)+0.004*[abs(Z(1,k)+1) - abs(Z(1,k)-1); abs(Z(3,k)+1) - abs(Z(3,k)-1); abs(Z(5,k)+1) - abs(Z(5,k)-1); abs(Z(7,k)+1) - abs(Z(7,k)-1); abs(Z(9,k)+1) - abs(Z(9,k)-1) ] ) + ...
                                t*[ 0;  -0.01*cos(Z(1,k));  0;  -0.01*cos(Z(3,k));  0;  -0.01*cos(Z(5,k));  0;  -0.01*cos(Z(7,k)); 0;  -0.01*cos(Z(9,k)) ]  ) +...
                      h2(:,k) * (  kron(I_N,A2)*Z(:,k) + kron(I_N,A2_d)*Z(:,k-3) + kron(I_N,B)* ( U2(:,k)+0.004*[abs(Z(1,k)+1) - abs(Z(1,k)-1); abs(Z(3,k)+1) - abs(Z(3,k)-1); abs(Z(5,k)+1) - abs(Z(5,k)-1); abs(Z(7,k)+1) - abs(Z(7,k)-1); abs(Z(9,k)+1) - abs(Z(9,k)-1) ] ) + ...
                                   t*[ 0;  -0.01*cos(Z(1,k));  0;  -0.01*cos(Z(3,k));  0;  -0.01*cos(Z(5,k));  0;  -0.01*cos(Z(7,k)); 0;  -0.01*cos(Z(9,k)) ]  );
      else
          U2(:,k)=( h1(:,k).*K1_15+h2(:,k).*K2_15 ) * [ e1;Z1(:,k);Z2(:,k) ] - e2 ;
          
          Z(:,k+1) =  h1(:,k) * (  kron(I_N,A1)*Z(:,k) + kron(I_N,B)*( U2(:,k)+0.004*[abs(Z(1,k)+1) - abs(Z(1,k)-1); abs(Z(3,k)+1) - abs(Z(3,k)-1); abs(Z(5,k)+1) - abs(Z(5,k)-1); abs(Z(7,k)+1) - abs(Z(7,k)-1); abs(Z(9,k)+1) - abs(Z(9,k)-1) ] ) ...
                        + t*[ 0;  -0.01*cos(Z(1,k));  0;  -0.01*cos(Z(3,k));  0;  -0.01*cos(Z(5,k));  0;  -0.01*cos(Z(7,k)); 0;  -0.01*cos(Z(9,k)) ]  ) + ...
                      h2(:,k) * (  kron(I_N,A2)*Z(:,k) + kron(I_N,B)*( U2(:,k)+0.004*[abs(Z(1,k)+1) - abs(Z(1,k)-1); abs(Z(3,k)+1) - abs(Z(3,k)-1); abs(Z(5,k)+1) - abs(Z(5,k)-1); abs(Z(7,k)+1) - abs(Z(7,k)-1); abs(Z(9,k)+1) - abs(Z(9,k)-1) ] ) ...
                        + t*[ 0;  -0.01*cos(Z(1,k));  0;  -0.01*cos(Z(3,k));  0;  -0.01*cos(Z(5,k));  0;  -0.01*cos(Z(7,k)); 0;  -0.01*cos(Z(9,k)) ] ) ;
      end
     
end

%% R1(k)
for k=1:1:121
    if k<15
       R1(:,k) =zeros(5,1);
    elseif k>=15 & k<=30
        R1(:,k) = ( (k-15)/10 )*100*ones(5,1);
    else
       R1(:,k) = 1.5*100*ones(5,1);
    end
end

%% 
figure(1);
plot(time,R1(1,:)/100,'k-',time,Tr0(1,:)/100,time,Tr0(2,:)/100,time,Tr0(3,:)/100,time,Tr0(4,:)/100,time,Tr0(5,:)/100,'LineWidth',1);
xlabel('time(s)','FontName','Times New Roman','FontSize',12);
ylabel('output response','FontName','Times New Roman','FontSize',12);
f1=legend('$r_{k}$','agent1','agent2','agent3','agent4','agent5','Location','NorthWest','FontName','Times New Roman');
set(f1,'Interpreter','latex','fontsize',10);

axes('Position',[0.4,0.55,0.5,0.2]); % 生成子图   
plot(time,R1(1,:)/100,'k-',time,Tr0(1,:)/100,time,Tr0(2,:)/100,time,Tr0(3,:)/100,time,Tr0(4,:)/100,time,Tr0(5,:)/100,'LineWidth',1);
ylim([1.11,1.113]); % 放大的横坐标
xlim([1.25,1.325]); % 放大的横坐标

figure(2);
plot(time,S2(1,:)/100,time,S2(2,:)/100,time,S2(3,:)/100,time,S2(4,:)/100,time,S2(5,:)/100,'LineWidth',1);
xlabel('time(s)','FontName','Times New Roman','FontSize',12);
ylabel('sliding mode surface ','FontName','Times New Roman','FontSize',12);
legend('agent1','agent2','agent3','agent4','agent5','FontName','Times New Roman','FontSize',10);

figure(3);
plot(time,U2(1,:)/100,time,U2(2,:)/100,time,U2(3,:)/100,time,U2(4,:)/100,time,U2(5,:)/100,'LineWidth',1);
xlabel('time(s)','FontName','Times New Roman','FontSize',12);
ylabel('control input','FontName','Times New Roman','FontSize',12);
legend('agent1','agent2','agent3','agent4','agent5','FontName','Times New Roman','FontSize',10);

axes('Position',[0.38,0.6,0.5,0.2]); % 生成子图   
plot(time,U2(1,:)/100,time,U2(2,:)/100,time,U2(3,:)/100,time,U2(4,:)/100,time,U2(5,:)/100,'LineWidth',1);
ylim([3.455,3.467]); % 放大的横坐标
xlim([1.322,1.355]); % 放大的横坐标

figure(4);
plot(time,W1(1,:)/100,time,W1(2,:)/100,time,W1(3,:)/100,time,W1(4,:)/100,time,W1(5,:)/100,'LineWidth',1);
xlabel('time(s)','FontName','Times New Roman','FontSize',12);
ylabel('tracking error','FontName','Times New Roman','FontSize',12);
legend('agent1','agent2','agent3','agent4','agent5','FontName','Times New Roman','FontSize',10);

% figure(5);
% plot(time,h1,time,h2,'LineWidth',1);
% xlabel('time(s)','FontName','Times New Roman','FontSize',12);
% ylabel('h','FontName','Times New Roman','FontSize',12);
% legend('h1','h2','FontName','Times New Roman','FontSize',10);
